#### BuiltInFailures.ImageFailures Members

---

|  |
| --- |
| BuiltInFailures ImageFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ImageFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BadViewType | Image Instances can't be placed in 3D Views. |
| Public property Static member | InvalidHeight | The image height must be must be no more than 30000 feet. |
| Public property Static member | InvalidWidth | The image width must be must be no more than 30000 feet. |

# See Also

BuiltInFailures ImageFailures Class

Autodesk.Revit.DB Namespace